МТСД/src/InformationRegisters/МТСД_ДанныеОбъектов/МТСД_ДанныеОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МТСД_ДанныеОбъектов</name>
  <resources>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.МТСД_СсылочныеТипыДоступныеВАвтономномРежиме</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

МТСД/src/InformationRegisters/МТСД_ДанныеОбъектов/ManagerModule.bsl
#Если АвтономныйСервер Тогда

Процедура ДобавитьДанные(Объект, ИмяДанных = "ОсновныеДанные", Данные) Экспорт
	
	УзелМТСД = ПланыОбмена.МТСД.ЦентральныйУзел();
	ДобавитьДанные_ЛюбойСервер(Объект, ИмяДанных, Данные, УзелМТСД);
	
КонецПроцедуры

#Иначе

Процедура ДобавитьДанные(Объект, ИмяДанных = "ОсновныеДанные", Данные, УзелМТСД) Экспорт
	
	ДобавитьДанные_ЛюбойСервер(Объект, ИмяДанных, Данные, УзелМТСД);
	
КонецПроцедуры

#КонецЕсли

#Область СлужебныеПроцедурыФункции

Процедура ДобавитьДанные_ЛюбойСервер(Объект, ИмяДанных, Данные, УзелМТСД)
	
	НаборЗаписей = РегистрыСведений.МТСД_ДанныеОбъектов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Объект);
	НаборЗаписей.Отбор.ИмяДанных.Установить(ИмяДанных);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Объект = Объект;
	НоваяЗапись.ИмяДанных = ИмяДанных;
	НоваяЗапись.Данные = Новый ХранилищеЗначения(Данные, Новый СжатиеДанных(9));
	
	НаборЗаписей.ОбменДанными.Получатели.Добавить(УзелМТСД);
	
КонецПроцедуры

#КонецОбласти
